app/views/quests/_form.html.erb

  <%= f.label :category %><br>
  <%= f.collection_select :category_ids,
                          Category.all, :id, :name, { selected: @quest.category_ids },
                          multiple: true %>
---
SELECT "categories".id FROM "categories" INNER JOIN "quest_categories" ON "categories"."id" = "quest_categories"."category_id" WHERE "quest_categories"."quest_id" = ?  [["quest_id", 5]]