app/controllers/quests_controller.rb

SELECT "quests".* FROM "quests"
---
  def index
    @quests = Quest.all

INSERT INTO "quests" ("created_at", "description", "image_url", "points", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @quest = Quest.new(quest_params)

    respond_to do |format|
      if @quest.save

UPDATE "quests" SET "description" = ?, "updated_at" = ? WHERE "quests"."id" = 5
---
  def update
    respond_to do |format|
      if @quest.update(quest_params)

SELECT  "quests".* FROM "quests"  WHERE "quests"."id" = ? LIMIT 1  [["id", 5]]
---
    def set_quest
      @quest = Quest.find(params[:id])